-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2021-11-12 11:00:02
-- 伺服器版本： 10.4.20-MariaDB
-- PHP 版本： 7.4.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `test111`
--

-- --------------------------------------------------------

--
-- 資料表結構 `trunk_order`
--

CREATE TABLE `trunk_order` (
  `sid` int(11) NOT NULL,
  `order_sid` varchar(255) NOT NULL,
  `member_sid` int(11) NOT NULL COMMENT '會員編號',
  `name` varchar(255) NOT NULL COMMENT '會員姓名',
  `mobile` varchar(255) NOT NULL COMMENT '手機',
  `orderprice` int(11) NOT NULL COMMENT '總價格',
  `delivery` varchar(255) NOT NULL COMMENT '配送及付款方式',
  `receiver` varchar(255) NOT NULL COMMENT '收件人',
  `delivery_address` varchar(255) NOT NULL COMMENT '收貨地址',
  `card` varchar(255) NOT NULL COMMENT '信用卡號',
  `order_date` date NOT NULL DEFAULT current_timestamp() COMMENT '訂單日期'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `trunk_order`
--

INSERT INTO `trunk_order` (`sid`, `order_sid`, `member_sid`, `name`, `mobile`, `orderprice`, `delivery`, `receiver`, `delivery_address`, `card`, `order_date`) VALUES
(1, '0', 1, '林玉伯', '0961329533', 1500, '信用卡', '林玉伯', '臺北市北投區竹子湖路33號', '3529118746911607', '2021-10-25'),
(2, '0', 2, '傅邦韻', '0986436405', 2000, '到貨付款', '傅邦韻', '臺北市松山區復興北路35號', '3558731506807551', '2021-10-25'),
(3, '0', 4, '彭豐明', '0970700551', 3000, '信用卡', '彭豐明', '臺北市南港區中坡南路34號', '3569627308823175', '2021-10-25'),
(4, '0', 5, '侯慧君', '0952197685', 4000, '到貨付款', '侯慧君', '臺北市士林區芝玉路28號', '3589372012493421', '2021-10-25'),
(5, '0', 7, '王怡剛', '0915772844', 2500, '信用卡', '王怡剛', '臺北市南港區中坡南路28號', '3589872880671156', '2021-10-25'),
(6, '0', 9, '李京俐', '0929572009', 3000, '信用卡', '李京俐', '臺北市士林區德行西路5號', '4029311488420977', '2021-10-26'),
(10, '2147483647', 10, '彭仁豪', '0956861758', 1540, '到貨付款', '彭仁豪', '臺北市信義區松壽路7號', '4434899517062637', '2021-10-26'),
(11, '2147483647', 10, '彭仁豪', '0956861758', 7140, '信用卡', '彭仁豪', '臺北市信義區松壽路7號', '4964256163387412', '2021-10-26'),
(12, '0', 12, '林政城', '0914875862', 7410, '信用卡', '林政城', ' 臺北市中正區仁愛路4號', '4863675061140130', '2021-10-27'),
(14, '0', 20, '李曉明', '0944555333', 123, '4800', '李曉明', '新北市', '1234456781204', '2021-11-05'),
(17, '0', 25, '李曉明', '0944555333', 123, '4800', '李曉明', '新北市', '1234456781204', '2021-11-05'),
(51, '2021116840', 9, '皮卡皮卡丘', '2786', 51600, '信用卡', 'sdsd', '台北市12312', '456456', '2021-11-06'),
(52, '2021116840', 9, '皮卡皮卡丘', '2786', 51600, '信用卡', 'sdsd', '台北市12312', '456456', '2021-11-06'),
(53, '2021116840', 9, '皮卡皮卡丘', '2786', 82400, '信用卡', 'sdsd', '台北市12312', '456456', '2021-11-06'),
(54, '2021116840', 9, '皮卡皮卡丘', '2786', 82400, '信用卡', 'sdsd', '台北市12312', '456456', '2021-11-06'),
(55, '2021116468', 9, '皮卡皮卡丘', '', 20800, '信用卡', '', '台北市', '', '2021-11-06'),
(56, '2021116494', 10, '李小龍', '0917123456', 20700, '信用卡', '李小龍', '台北市XX路', '4356666699997777', '2021-11-06'),
(57, '2021117475', 10, '李小龍', '0931256789', 27800, '信用卡', '噴火龍', '台北市', '456782345678521', '2021-11-07'),
(58, '202111859', 14, 'Bill', '012', 4800, '信用卡', 'BILL', '台北市012', '435212345785', '2021-11-08'),
(59, '2021118245', 17, 'bob', '546', 14590, '宅配到貨付款', 'sdad', '台北市456', '544', '2021-11-08'),
(60, '2021118486', 17, 'bob', '123455', 3800, '宅配到貨付款', '了了', '台北市sds', '4111561', '2021-11-08'),
(61, '2021118626', 20, '', '01', 14600, '信用卡', 'ggg', '台北市21321', '123456', '2021-11-08'),
(62, '2021118313', 20, '', '012', 9800, '信用卡', 'ggg', '台北市123', '1442', '2021-11-08'),
(63, '2021118787', 21, '', '125', 18600, '宅配到貨付款', '小小', '台北市125', '2144', '2021-11-08'),
(64, '2021118506', 21, '小小', '213', 4800, '宅配到貨付款', '123', '台北市123', '123', '2021-11-08'),
(65, '2021118264', 21, '小小', '0122', 8900, '信用卡', '14', '台北市123', '12', '2021-11-08'),
(66, '2021119358', 21, '小小', '00011122', 16200, '信用卡', 'QQQ', '台北市asd', '0123', '2021-11-09'),
(67, '2021119500', 21, '小小', '10', 37860, '信用卡', 'wwq', '台北市145', '1', '2021-11-09'),
(72, '20211110384', 23, 'bbb', '11', 15250, '信用卡', '11', '新北市板橋區11', '11', '2021-11-10'),
(73, '20211110698', 23, 'bbb', '1122', 10600, '宅配到貨付款', '123', '新北市板橋區123', '123', '2021-11-10'),
(74, '20211110533', 12, 'bob', '11', 18850, '宅配到貨付款', '555', '新北市板橋區111', '111', '2021-11-10'),
(75, '20211110556', 12, 'bob', '11', 9800, '', 'ss', '新北市板橋區123', '123', '2021-11-10'),
(76, '20211111981', 17, 'bob22', '021', 4350, '信用卡', 'sdds', '新北市板橋區123', '21345', '2021-11-11'),
(77, '20211111997', 14, 'Bill', '123123', 13800, '宅配到貨付款', 'dsdsa', '新北市板橋區123123', '123123', '2021-11-11'),
(78, '20211111565', 21, '小小', '111', 13200, '信用卡', 'aaa', '新北市板橋區a11111', '5465', '2021-11-11'),
(79, '20211111210', 21, '小小', '2015', 4850, '信用卡', '2015', '新北市板橋區2015', '4351', '2021-11-11'),
(80, '2021111173', 21, '小小', '2000', 4000, '信用卡', '2000', '新北市板橋區2000', '2000', '2021-11-11'),
(81, '20211111652', 21, '小小', '12500', 12500, '宅配到貨付款', '12500', '新北市板橋區12500', '12500', '2021-11-11'),
(82, '20211111718', 21, '小小', '40500644', 4050, '宅配到貨付款', '40500644', '新北市板橋區40500644', '40500644', '2021-11-11'),
(83, '20211111681', 20, '小名', '123543', 8400, '宅配到貨付款', '456', '新北市板橋區132453', '12354', '2021-11-11'),
(84, '20211112617', 31, '1112RONG', '20300', 20300, '信用卡', '20300', '新北市板橋區20300', '20300', '2021-11-12'),
(85, '20211112124', 31, '1112RONG', '8450', 8450, '宅配到貨付款', '8450', '新北市板橋區8450', '8450', '2021-11-12'),
(86, '20211112322', 31, '1112RONG', '0238', 4050, '宅配到貨付款', '0238', '新北市板橋區0238', '0238', '2021-11-12'),
(87, '20211112898', 31, '1112RONG', '0250', 5400, '宅配到貨付款', '0250', '新北市板橋區0250', '0250', '2021-11-12'),
(88, '20211112481', 31, '1112RONG', '0251', 11550, '宅配到貨付款', '0251', '新北市板橋區0251', '0251', '2021-11-12'),
(89, '20211112300', 31, '1112RONG', '0253', 8900, '信用卡', '0253', '新北市板橋區0253', '251', '2021-11-12'),
(90, '2021111286', 31, '1112RONG', '0255', 19900, '宅配到貨付款', '0255', '新北市板橋區0255', '0255', '2021-11-12'),
(91, '20211112502', 31, '1112RONG', '0325', 9300, '宅配到貨付款', '0325', '新北市板橋區0325', '0325', '2021-11-12'),
(92, '20211112767', 23, '0123', '550', 10400, '宅配到貨付款', '0551', '新北市板橋區0551', '0551', '2021-11-12');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `trunk_order`
--
ALTER TABLE `trunk_order`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `trunk_order`
--
ALTER TABLE `trunk_order`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=93;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
